# Praktica 1
import math
import random
import statistics

# Вхідні данні
V0 = float(input('Введіть обємну витрату масу газу за нормальних умов, м3/год:'))
tc = float(input('Введіть температуру газу, С:'))
Pg = float(input('Введіть густину газу, кг/м3:'))
Vg = float(input('Введдіть кінематичну вязкість газу, м2/с:'))
dmin = float(input('Введіть розмір уловлювальних частинок, мм:'))
Pt = float(input('Введіть густину матеріалу частинок, кг/м3:'))
Fit = float(input('Введіть коефіціент форми частинок:'))
g = 9.81
SigVh = 0.5
SigRR = 1.0
Sig90 = 1.0
Sig180 = 1.5
SigRz = 1.0
SigVuh = 1.0
# 1.Значення критерію Архімеда частинок кулястої форми, які осаджуються
Ar = ((g * dmin ** 3) / (Vg ** 2)) * ((Pt - Pg) / Pg)
print('1.Значення критерію Архімеда частинок кулястої форми, які осаджуються', Ar)
# 2.Значення критерію Рейнольдса для частинок кулястої форми, які осаджу-ються в полі сили тяжіння
if Ar <= 36:
    Re = 0.056 * Ar
if 36 < Ar <= 84000:
    Re = 0.152 * Ar ** 0.714
if Ar > 84000:
    Re = 1.740 * Ar ** 0.5
print('2.Ваше число Рейнольдса:', Re)
# 3.Швидкість осадження частинок кулястої форми
w0 = ((Re * Vg) / dmin)
print('3.Швидкість осадження частинок кулястої форми:', w0)
# 4.Швидкість вільного осадження частинок, які мають коефіцієнт форми
woc = Fit * w0
print('4.Швидкість вільного осадження частинок, які мають коефіцієнт форми:', woc)
# 5.Об’ємна витрата газу за робочих умов
V = (V0 / 3600) * ((tc + 273) / 273)
print('5.Об’ємна витрата газу за робочих умов:', V)
# 6.Поверхня осадження (загальна поверхня полиць)
F0 = V / woc
print('6.Поверхня осадження (загальна поверхня полиць:', F0)
# 7.Задаємося розмірами полиць
B = float(random.uniform(1.5, 3))
print('7.1.ширина полиц B,м:', B)
L = float(random.uniform(2, 3))
print('7.2.довжина полиці L,м:', L)
hp1 = float(random.randint(10, 16))
hp = hp1 * 10 ** -3
print('7.3.товщина полиці hp,м:', hp)
# 8.Кількість полиць у камері з округленням до найближчого більшого цілого
n = math.ceil((F0 / (L * B) + 0.5))
print('8.Кількість полиць у камері з округленням до найближчого більшого цілого:', n)
# 9.Максимально допустима швидкість газу, при якій завислі частинки не вино-сяться з камери
Wmax = 3.6 * math.sqrt(dmin * ((Pt - Pg) / Pg))
print('9.Максимально допустима швидкість газу, при якій завислі частинки не вино-сяться з камери:', Wmax)
# 10.Робоча швидкість газу між полицями
Omega1 = 0.2
OmegaList = []
while Omega1 < 0.31:
    Omega1 = Omega1 + 0.01
    OmegaList.append(Omega1)
Omega = (statistics.mean(OmegaList)) * Wmax
print('10.Робоча швидкість газу між полицями', Omega)
# 11.Час перебування газу в міжполичному просторі
Tay = L / Omega
print('11.Час перебування газу в міжполичному просторі', Tay)
# 12.Відстань між полицями
h = Tay * woc
print('12.Відстань між полицями', h)
# 13.Висота поличної частини камери
H = n * (h + hp)
print('13.Висота поличної частини камери', H)
# 14.Еквівалентний діаметр каналу прямокутного перерізу міжполичного прос-тору
if h / B <= 0.1:
    de = 2 * h
if h / B > 0.1:
    de = (2 * h * B / (h + B))
print('14.Еквівалентний діаметр каналу прямокутного перерізу міжполичного прос-тору', de)
# 15.Критерій Рейнольдса для потоку газу в міжполичному просторі
Re15 = ((Omega * de) / Vg)
print('15.Критерій Рейнольдса для потоку газу в міжполичному просторі', Re15)
# 16. Коефіцієнт форми для прямокутного каналу
if h / B < 0.1:
    Fiak = 1.5
if h / B >= 0.1:
    Fiak = 0.83 * ((h / B) ** 2) - 1.39 * (h / B) + 1.46
print('16.Коефіцієнт форми для прямокутного каналу', Fiak)
# 17. Коефіцієнт тертя газу по поверхні полиці
if Re15 <= 2300:
    Lyamda = ((64 * Fiak) / Re15)
if Re15 > 2300:
    lyamda = ((0.3164 * Fiak) / (Re15 ** 0.75))
print('17. Коефіцієнт тертя газу по поверхні полиці', Lyamda)
# 18.Сумарний коефіцієнт місцевих опорів
SumSig = SigVh + SigRR + 4 * Sig90 + Sig180 + SigRz + SigVuh
print('18.Сумарний коефіцієнт місцевих опорів', SumSig)
# 19.Гідравлічний опір пилоосаджувальної камери
DetP = (Lyamda * (L / de) + SumSig) * ((Pg * (Omega ** 2)) / 2)
print('19.Гідравлічний опір пилоосаджувальної камери', DetP)
# Висновок
print('Основні параметри пилоосаджувальної камери:')
print('ширина полиць,м –', B)
print('довжина полиць,м –', L)
print('Товщина полиць,м –', hp)
print('Відстань між полицями,м –', h)
print('Висота поличної частини камери,м -', H)
print('Загальна поверхня полиць,м2 -', F0)
print('Загальна кількість полиць –', n)
print('Гідравлічний опір багатополичної гідравлічної камери,Па', DetP)
print('Данная практика сделана бывшим студентом КПИ, группы ЛП-72, Малыгином Дмитрием')
