# Praktika 2
# Розрахунок відстійника періодичної дії
import math
import random
import statistics

# Вихідні данні
Ggod = float(input('Введіть масову витрату вихідної суспензії, т/год:'))
Gmass = float(input('Введіть масу вихідної суспензії, т/год:'))
Pp = float(input('Введіть густину дисперсійного середовища кг/м3:'))
Vp = float(input('Введіть кінематичну вязкість м2/с:'))
Pt = float(input('Введіть густину матеріалу твердої дисперсної фази:'))
dmin = float(input('Введіть мінімальний розмір осаджувальних частинок:'))
Fit = float(input('Введіть коефіціент форми:'))
Xp = float(input('Введіть масову частку дисперсної частки вихідної суспензії:'))
Xk = float(input('Введіть масову частку дисперсної частки згущенної суспензії:'))
n = float(input('Введіть середнє розведення твердої фази в зоні згущення відсітйника:'))
g = 9.81
# 1. Значення критерію Архімеда частинок кулястої форми, які осаджуються
Ar = (((g * (dmin ** 3)) / (Vp ** 2)) * ((Pt - Pp) / Pp))
print('1. Значення критерію Архімеда частинок кулястої форми, які осаджуються:', Ar)
# 2. Значення критерію Рейнольдса для частинок кулястої форми, які осаджуються в полі сили тяжіння
if Ar <= 36:
    Re0 = 0.056 * Ar
elif 36 < Ar <= 84000:
    Re0 = 0.152 * Ar ** 0.714
elif Ar > 84000:
    Re0 = 1.740 * Ar ** 0.5
print('2. Значення критерію Рейнольдса для частинок кулястої форми, які осаджуються в полі сили тяжіння:', Re0)
# 3. Швидкість осадження частинок кулястої форми
w0 = (Re0 * Vp) / dmin
print('3. Швидкість осадження частинок кулястої форми:', w0)
# 4. Швидкість вільного осадження частинок, які мають коефіцієнт форми
Wos = Fit * w0
print('4. Швидкість вільного осадження частинок, які мають коефіцієнт форми:', Wos)
# 5. Об'ємна частка твердої фази у вихідній суспензії
Xpp = (Xp * Pp) / (Xp * Pp + (1 - Xp) * Pt)
print('5. Обємна частка твердої фази у вихідній суспензії:', Xpp)
# 6. Швидкість стисненого осадження заданих частинок
Wc = Wos * (-4.5 * Xpp + math.sqrt(20.25 * (Xpp ** 2) + ((1 - Xpp) ** 3)))
print('6. Швидкість стисненого осадження заданих частинок:', Wc)
# 7. Масова витрата дисперсійного середовища, що надходить у складі вихідної суспензії у відстійник
Gp = Ggod * (1 - Xp)
print('7. Масова витрата дисперсійного середовища, що надходить у складі вихідної суспензії у відстійник:', Gp)
# 8. Масова витрата дисперсної фази, що надходить у складі вихідної суспензії у відстійник
Gt = Ggod - Gp
print('8. Масова витрата дисперсної фази, що надходить у складі вихідної суспензії у відстійник:', Gt)
# 9. Об'ємна витрата дисперсійного середовища, що надходить у складі вихідної суспензії у відстійник
Vpp = Gp / Pp
print('9. Обємна витрата дисперсійного середовища, що надходить у складі вихідної суспензії у відстійник:', Vpp)
# 10. Відносна масова частка дисперсної фази у вихідній суспензії
XpP = Xp / (1 - Xp)
print('10. Відносна масова частка дисперсної фази у вихідній суспензії:', XpP)
# 11. Відносна масова частка дисперсної фази у згущеній суспензії
XkK = Xk / (1 - Xk)
print('11. Відносна масова частка дисперсної фази у згущеній суспензії:', XkK)
# 12. Площа відстійника
F0 = ((Vpp) / (3600 * Wc)) * ((XkK - XpP) / XkK)
print('12. Площа відстійника:', F0)
# 13. Розрахунковий діаметр відстійника
Ddiap = [1.8, 3.6, 6.0, 9.0, 12.0, 15.0, 18.0, 24.0, 30.0]
Dsht = math.floor(math.sqrt((4 * F0) / (math.pi)))
print('Розрахунковий діаметр відстійника:', Dsht)
rDsht = 0
for element in Ddiap:
    if Dsht <= element:
        rDsht = element
        break
print('13. Виконавчий діаметр відстійника D:', rDsht)
# 14. Маса дисперсної фази, що осаджується за одну годину на 1 м2 по-верхні осадження
gt = (4 * Gt) / (math.pi * (rDsht ** 2))
print('14. Маса дисперсної фази, що осаджується за одну годину на 1 м2 по-верхні осадження:', gt)
# 15. Відносна густина суспензії в зоні згущення
Beta = ((Pt / Pp) * (n + 1)) / (((n * Pt / Pp)) + 1)
print('15. Відносна густина суспензії в зоні згущення:', Beta)
# 16. Масова частка твердої фази в суспензії в зоні згущення
Xzc = 1 / (1 + n)
print('16. Масова частка твердої фази в суспензії в зоні згущення:', Xzc)
# 17. Масова концентрація твердої фази в згущеній суспензії
Czc = Beta * Pp * Xzc
print('17. Масова концентрація твердої фази в згущеній суспензії:', Czc)
# 18. Висота зони вільного осадження (освітленої рідини) h1 обирається з інтервалу 0,45–0,75 м
h1 = float(random.uniform(0.45, 0.75))
print('Висота зони вільного осадження (освітленої рідини) h1 обирається з інтер-валу 0,45–0,75 м, вибираємо h1:', h1)
# 19. Висота зони згущення
h2 = gt / Czc
print('19. Висота зони згущення:', h2)
# 20. Вибираємо висоту зони розташування гребка
h3 = 0.073 * rDsht
print('20. Вибираємо висоту зони розташування гребка:', h3)
# 21. Загальна висота безперервного відстійника
Hb = h1 + h2 + h3
print('21. Загальна висота безперервного відстійника', Hb)
print('----------------------------------------------------------------------------------------------------------')
print('Розрахунок відстійника періодичної дії')
print('2.1 Значення критерію Архімеда частинок кулястої форми, які осаджуються:', Ar)
print('2.2 Значення критерію Рейнольдса для частинок кулястої форми, які осаджуються в полі сили тяжіння:', Re0)
print('2.3 Швидкість осадження частинок кулястої форми:', w0)
print('2.4 Швидкість вільного осадження частинок, які мають коефіцієнт форми:', Wos)
print('2.5 Обємна частка твердої фази у вихідній суспензії:', Xpp)
print('2.6 Швидкість стисненого осадження заданих частинок:', Wc)
print('2.7 Масова витрата дисперсійного середовища, що надходить у складі вихідної суспензії у відстійник:', Gp)
print('2.8 Масова витрата дисперсної фази, що надходить у складі вихідної суспензії у відстійник:', Gt)
print('2.9 Обємна витрата дисперсійного середовища, що надходить у складі вихідної суспензії у відстійник:', Vpp)
print('2.10 Відносна масова частка дисперсної фази у вихідній суспензії:', XpP)
print('2.11 Відносна масова частка дисперсної фази у згущеній суспензії:', XkK)
print('2.12 Площа відстійника:', F0)
print('Розрахунковий діаметр відстійника:', Dsht)
print('2.13 Виконавчий діаметр відстійника D:', rDsht)
# 2.14 Густина вихідної суспензії
Ppvc = (Pt * Pp) / (Xp * Pp + (1 - Xp) * Pt)
print('2.14 Густина вихідної суспензії:', Ppvc)
# 2.15 Об'єм вихідної суспензії
Vvc = Gmass / Ppvc
print('2.15 Обєм вихідної суспензії:', Vvc)
# 2.16 Висота відстійника періодичної дії
Hvc = (4 * Vvc) / (math.pi * (rDsht ** 2))
print('2.16 Висота відстійника періодичної дії:', Hvc)
# 2.17 Час розділення вихідної суспензії
Tay = Hvc / (3600 * Wc)
print('2.17 Час розділення вихідної суспензії:', Tay)
# 2.18 Масова продуктивність відстійника періодичної дії
GM = Gmass / Tay
print('2.18 Масова продуктивність відстійника періодичної дії', GM)
print('Висновок:')
print('Визначили основні розміри гравітаційного гребкового рідинного від-стійника безперервної дії:')
print('площа - ', F0)
print('діаметр - ', rDsht)
print('Висота - ', Hb)
print(
    f'Висота гравітаційного гребкового рідинного відстійника періодичної дії – висота – {Hvc} м, а його продуктивність – {GM} т/год.')
print('Данная практика сделана бывшим студентом КПИ, группы ЛП-72, Малыгином Дмитрием')
