# Prakrika 3
import math
import random
import statistics

# Вихідні данні
V0 = float(input('Введіть обємну витрату повітря -'))
t = float(input('Введіть температуру -'))
Pg = float(input('Введіть густину -'))
Vg = float(input('Введіть кінематичну вязкість -'))
dmin = float(input('Введіть найменший розмір уловлювальних частинок -'))
Fit = float(input('Введіть коефіціент форми -'))
Pt = float(input('Введіть густину матеріалу -'))
TypeCiklon = str(input('Введіть тип циклону -'))
WP = 20
g = 9.81
# 1. Об'ємна витрата газу за робочих умов, м3/с
V = (V0 / 3600) * ((t + 273) / 273)
print('1. Обємна витрата газу за робочих умов, м3/с - ', V)
# 2. Площа поперечного перерізу вхідного патрубка
Fp = V / WP
print('2. Площа поперечного перерізу вхідного патрубка - ', Fp)
# 3. Ширина вхідного патрубка
if TypeCiklon == 'ЦККБ':
    VusPat = 2
    Diam = 5.7
    Zovdiam = 3.7
    VusCulic = 5.7
    Vuskon = 4.3
if TypeCiklon == 'ВТИ':
    VusPat = 4
    Diam = 5.9
    Zovdiam = 3.3
    VusCulic = 4.77
    Vuskon = 5.05
if TypeCiklon == 'НИИОГАЗ':
    VusPat = 3.14
    Diam = 4.75
    Zovdiam = 2.75
    VusCulic = 7.6
    Vuskon = 9.5
b = math.sqrt(Fp / VusPat)
print('3. Ширина вхідного патрубка - ', b)
# 4. Орієнтовне значення діаметра циклона
Dvub = [0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.2, 1.4, 1.6, 1.8, 2.0]
Dsht1 = VusCulic * b
print('4. Орієнтовне значення діаметра циклона - ', Dsht1)
rDsht = 0
for element in Dvub:
    if Dsht1 <= element:
        rDsht = element
        break
print('Оріентовно виконавчій діаметр D - ', rDsht)
# 5. Швидкість газу в циклоні w береться рівною 12–14 м/с.
Omega = float(random.uniform(12, 14))
print('5. Швидкість газу в циклоні w береться рівною 12–14 м/с. Отже беремо - ', Omega)
# 6. Фактор розділення для циклона
Kc = (2 * (Omega ** 2)) / g * rDsht
print('6. Фактор розділення для циклона - ', Kc)
# 7. Значення критерію Архімеда частинок кулястої форми, які оса-джуються
Ar = ((g * (dmin ** 3)) / (Vg ** 2)) * ((Pt - Pg) / Pg)
print('7. Значення критерію Архімеда частинок кулястої форми, які оса-джуються - ', Ar)
# 8. Значення критерію Рейнольдса для частинок кулястої форми, які осаджуються в полі відцентрових сил
if Ar * Kc <= 36:
    Re0 = 0.056 * (Ar * Kc)
if 36 < (Ar * Kc) <= 84000:
    Re0 = 0.152 * ((Ar * Kc) ** 0.714)
if Ar * Kc > 84000:
    Re0 = 1.740 * ((Ar * Kc) ** 0.5)
print('8. Значення критерію Рейнольдса для частинок кулястої форми, які осаджуються в полі відцентрових сил - ', Re0)
# 9. Швидкість осадження частинок кулястої форми
w0 = (Re0 * Vg) / dmin
print('9. Швидкість осадження частинок кулястої форми - ', w0)
# 10. Швидкість осадження частинок, які мають коефіцієнт форми
Wos = Fit * w0
print('10. Швидкість осадження частинок, які мають коефіцієнт форми - ', Wos)
# 11. Швидкість очищеного газу в центральній трубі трубі береться рівною 4...8 м/с
Wcc = float(random.uniform(4, 8))
print(f'11. Швидкість очищеного газу в центральній трубі береться рівною 4...8 м/с. Отже беремо Wц = {Wcc}, м/с')
# 12. Розрахунковий внутрішній діаметр центральної труби
DcMass = [133, 159, 168, 219, 273, 325, 377, 426, 480, 530, 630, 720, 820, 920, 1020, 1120, 1220, 1320, 1420]
Dcc = math.sqrt((4 * V) / (math.pi * Wcc))
print('Розрахунковий внутрішній діаметр центральної труби - ', Dcc)
Tyk = 0
for element in DcMass:
    if Dcc <= element:
        Tyk = element
        break
print('12. Виконавчий зовнішній діаметр центральної труби dц - ', Tyk)
# 13. Розрахунковий діаметр циклона
